LEXICON: dict[str, str] = {
    '/start': '<b>Привет, путешественник!</b>\n\nЭто бот, в котором '
              'Вот некоторые доступные команды: \n'
              '- /start: Начать взаимодействие с ботом\n'
              '- /help: Получить справку о командах бота\n'
              '- /menu: Выбрать части света',
    '/help': 'Список команд:\n\n'
             '- /start: Начать взаимодействие с ботом\n'
             '- /help: Получить справку о командах бота\n'
             '- /menu: Выбрать части света\n',
    'other_answer': 'Извини, увы, это сообщение мне непонятно...',
    'select_from_list': 'Выберите из списка',
    'no': 'К сожалению, данных нет'
}

LEXICON_COMMANDS: dict[str, str] = {
    '/start': 'Начать взаимодействие с ботом',
    '/help': 'Получить справку о командах бота',
    '/menu': 'Выбрать части света'
}
