query = '''
drop table if exists regions;
drop table if exists countries;
drop table if exists cities;
drop table if exists russian_cities;

CREATE TABLE regions (
    id INT PRIMARY KEY,
    part_of_world VARCHAR(255)
);

INSERT INTO regions (id, part_of_world) VALUES
(1, 'Азия'),
(2, 'Европа'),
(3, 'Африка'),
(4, 'Америка'),
(5, 'Австралия и Океания');

CREATE TABLE countries (
    id_part_of_world INT,
    id INT PRIMARY KEY,
    country VARCHAR(255)
);

INSERT INTO countries (id_part_of_world, id, country) VALUES
(1, 1, 'Вьетнам'),
(1, 2, 'Индия'),
(1, 3, 'Индонезия'),
(1, 4, 'Катар'),
(1, 5, 'ОАЭ'),
(1, 6, 'Китай'),
(1, 7, 'Грузия'),
(1, 8, 'Монголия'),
(1, 9, 'Япония'),
(1, 10, 'Тайланд'),
(2, 11, 'Норвегия'),
(2, 12, 'Дания'),
(2, 13, 'Швеция'),
(2, 14, 'Швейцария'),
(2, 15, 'Финляндия'),
(2, 16, 'Франция'),
(2, 17, 'Великобритания'),
(2, 18, 'Испания'),
(2, 19, 'Италия'),
(2, 20, 'Греция'),
(3, 21, 'Алжир'),
(3, 22, 'Египет'),
(3, 23, 'Кения'),
(3, 24, 'Конго'),
(3, 25, 'Ливия'),
(3, 26, 'ЮАР'),
(3, 27, 'Сейшельские острова'),
(3, 28, 'Нигерия'),
(3, 29, 'Марокко'),
(3, 30, 'Судан'),
(4, 31, 'США'),
(4, 32, 'Канада'),
(4, 33, 'Доминикана'),
(4, 34, 'Мексика'),
(4, 35, 'Куба'),
(4, 36, 'Колумбия'),
(4, 37, 'Аргентина'),
(4, 38, 'Бразилия'),
(4, 39, 'Чили'),
(4, 40, 'Перу'),
(5, 41, 'Новая Зеландия'),
(5, 42, 'Австралия'),
(5, 43, 'Папуа - Новая Гвинея');

CREATE TABLE cities (
    id INT PRIMARY KEY,
    id_country INT,
    city VARCHAR(255)
);

INSERT INTO cities (id, id_country, city) VALUES
(1, 1, 'Нячанг'),
(2, 1, 'Фантьет'),
(3, 1, 'Сапа'),
(4, 2, 'Дели'),
(5, 2, 'Мумбаи'),
(6, 2, 'Калькутта'),
(7, 3, 'Джакарта'),
(8, 3, 'Бали'),
(9, 3, 'Джокьякарта'),
(10, 4, 'Доха'),
(11, 4, 'Духан'),
(12, 4, 'Эр-Рувайс'),
(13, 5, 'Дубай'),
(14, 5, 'Абу-Даби'),
(15, 5, 'Шарджа'),
(16, 6, 'Пекин'),
(17, 6, 'Шанхай'),
(18, 6, 'Гонконг'),
(19, 7, 'Батуми'),
(20, 7, 'Тбилиси'),
(21, 7, 'Боржоми'),
(22, 8, 'Улан-Батор'),
(23, 8, 'Дархан'),
(24, 8, 'Мурэн'),
(25, 9, 'Токио'),
(26, 9, 'Осака'),
(27, 9, 'Киото'),
(28, 10, 'Бангкок'),
(29, 10, 'Паттайя'),
(30, 10, 'Пхукет'),
(31, 11, 'Осло'),
(32, 11, 'Берген'),
(33, 11, 'Тронхейм'),
(34, 12, 'Копенгаген'),
(35, 12, 'Орхус'),
(36, 12, 'Оденсе'),
(37, 13, 'Стокгольм'),
(38, 13, 'Гётеборг'),
(39, 13, 'Мальмё'),
(40, 14, 'Цюрих'),
(41, 14, 'Женева'),
(42, 14, 'Берн'),
(43, 15, 'Хельсинки'),
(44, 15, 'Эспоо'),
(45, 15, 'Тампере'),
(46, 16, 'Париж'),
(47, 16, 'Марсель'),
(48, 16, 'Лион'),
(49, 17, 'Лондон'),
(50, 17, 'Эдинбург'),
(51, 17, 'Ливерпуль'),
(52, 18, 'Мадрид'),
(53, 18, 'Барселона'),
(54, 18, 'Валенсия'),
(55, 19, 'Рим'),
(56, 19, 'Венеция'),
(57, 19, 'Милан'),
(58, 20, 'Салоники'),
(59, 20, 'Афины'),
(60, 20, 'Ираклион'),
(61, 21, 'Алжир'),
(62, 21, 'Оран'),
(63, 21, 'Аннаба'),
(64, 22, 'Каир'),
(65, 22, 'Александрия'),
(66, 22, 'Шарм эль Шейх'),
(67, 23, 'Найроби'),
(68, 23, 'Момбаса'),
(69, 23, 'Накуру'),
(70, 24, 'Браззавиль'),
(71, 24, 'Пуэнт-Нуар'),
(72, 25, 'Бенгази'),
(73, 25, 'Триполи'),
(74, 25, 'Тархуна'),
(75, 26, 'Йоханнесбург'),
(76, 26, 'Соуэто'),
(77, 26, 'Гебеха'),
(78, 27, 'Виктория'),
(79, 27, 'Маэ'),
(80, 27, 'Праслин'),
(81, 28, 'Лагос'),
(82, 28, 'Кано'),
(83, 28, 'Абуджа'),
(84, 29, 'Ксабланка'),
(85, 29, 'Марракеш'),
(86, 29, 'Фес'),
(87, 30, 'Хартум'),
(88, 30, 'Омдурман'),
(89, 30, 'Ньяла'),
(90, 31, 'Лос-Анджелес'),
(91, 31, 'Нью-Йорк'),
(92, 31, 'Чикаго'),
(93, 31, 'Хьюстон'),
(94, 32, 'Торонто'),
(95, 32, 'Монреаль'),
(96, 32, 'Оттава'),
(97, 33, 'Пунта-Кана'),
(98, 33, 'Санто-Доминго'),
(99, 33, 'Ла-Романа'),
(100, 34, 'Мехико'),
(101, 34, 'Тихуана'),
(102, 34, 'Гвадалахара'),
(103, 35, 'Гавана'),
(104, 35, 'Сантьяго-де-Куба'),
(105, 35, 'Санта-Клара'),
(106, 36, 'Букараманга'),
(107, 36, 'Богота'),
(108, 36, 'Кали'),
(109, 37, 'Буэнос-Айрес'),
(110, 37, 'Кордова'),
(111, 37, 'Росарио'),
(112, 38, 'Сан-Паулу'),
(113, 38, 'Рио-де-Жанейро'),
(114, 38, 'Бразилиа'),
(115, 39, 'Сантьяго'),
(116, 39, 'Пуэнте-Альто'),
(117, 39, 'Антофагаста'),
(118, 40, 'Лима'),
(119, 40, 'Трухильо'),
(120, 40, 'Арекипа'),
(121, 41, 'Гамильтон'),
(122, 41, 'Тауранга'),
(123, 41, 'Окленд'),
(124, 42, 'Мельбурн'),
(125, 42, 'Сидней'),
(126, 42, 'Перт'),
(127, 43, 'Порт-Морсби'),
(128, 43, 'Вевак'),
(129, 43, 'Лаэ');


CREATE TABLE russian_cities (
    id SERIAL PRIMARY KEY,
    city VARCHAR(255) NOT NULL,
    code VARCHAR(3) NOT NULL
);

INSERT INTO russian_cities (city, code) VALUES
('АБАКАН', 'ABA'),
('АНАДЫРЬ', 'DYR'),
('АНАПА', 'AAQ'),
('АПАТИТЫ', 'WZA'),
('АРХАНГЕЛЬСК', 'ARH'),
('АСТРАХАНЬ', 'ASF'),
('БАЛАКОВО', 'BWO'),
('БАРНАУЛ', 'BAX'),
('БЕЛГОРОД', 'EGO'),
('БЕЛОЯРСКИЙ', 'BCX'),
('БЕРЕЗНИКИ', 'WZC'),
('БЛАГОВЕЩЕНСК', 'BQS'),
('БРАТСК', 'BTK'),
('БУГУЛЬМА', 'UUA'),
('БЫКОВО', 'BKA'),
('ЧЕБОКСАРЫ', 'CSY'),
('ЧЕЛЯБИНСК', 'CEK'),
('ЧЕРЕПОВЕЦ', 'CEE'),
('ЧИТА', 'HTA'),
('ЕЙСК', 'WZD'),
('ЕКАТЕРИНБУРГ', 'SVX'),
('ЭЛИСТА', 'ESL'),
('ЕВПАТОРИЯ', 'EV'),
('ГЕЛЕНДЖИК', 'GDZ'),
('ГРОЗНЫЙ', 'GRV'),
('ХАНТЫ-МАНСИЙСК', 'WZE'),
('ИНТА', 'INA'),
('ИРКУТСК', 'IKT'),
('ИВАНОВО', 'IWA'),
('ИЖЕВСК', 'IJK'),
('КАЛИНИНГРАД', 'KGD'),
('КАЗАНЬ', 'KZN'),
('КЕМЕРОВО', 'KEJ'),
('КЕРЧЬ', 'KE'),
('ХАБАРОВСК', 'KHV'),
('ХИБИНЫ', 'WZT'),
('КИРОВ', 'KVX'),
('КИРОВСК', 'KVK'),
('КОГАЛЫМ', 'KGP'),
('КОЛХИ', 'WZH'),
('КОМСОМОЛЬСК-НА-АМУРЕ', 'KXK'),
('КРАЙНИЙ', 'WZI'),
('КРАСНОДАР', 'KRR'),
('КРАСНОЯРСК', 'KJA'),
('КУРГАН', 'KRO'),
('КУРСК', 'KUR'),
('ЛИПЕЦК', 'LPK'),
('МАГАДАН', 'GDX'),
('МАГНИТОГОРСК', 'MQF'),
('МАЙКОП', 'WZJ'),
('МАХАЧКАЛА', 'MCX'),
('МИНЕРАЛЬНЫЕ ВОДЫ', 'MRV'),
('МИРНЫЙ', 'MJZ'),
('МОСКВА', 'MOW'),
('МУРМАНСК', 'MMK'),
('НАБЕРЕЖНЫЕ ЧЕЛНЫ', 'NBC'),
('НАДЫМ', 'NYM'),
('НАХИЧЕВАНЬ', 'WZL'),
('НАЛЬЧИК', 'NAL'),
('НАРЬЯН-МАР', 'NNM'),
('НАЗРАНЬ', 'IGT'),
('НЕФТEЮГАНСК', 'NFG'),
('НЕРЮНГРИ', 'NER'),
('НИЖНЕВАРТОВСК', 'NJC'),
('НИЖНИЙ НОВГОРОД', 'GOJ'),
('НОЯБРЬСК', 'NOJ'),
('НОРИЛЬСК', 'NSK'),
('ВЕЛИКИЙ НОВГОРОД', 'GNO'),
('НОВОКУЗНЕЦК', 'NOZ'),
('НОВОСИБИРСК', 'OVB'),
('НОВЫЙ УРЕНГОЙ', 'NUX'),
('НЯГАНЬ', 'WZM'),
('ОМСК', 'OMS'),
('ОРЕНБУРГ', 'REN'),
('ОРСК', 'OSW'),
('ПЕНЗА', 'PEZ'),
('ПЕРМЬ', 'PEE'),
('ПЕТРОПАВЛОВСК-КАМЧАТСКИЙ', 'PKC'),
('ПЕТРОЗАВОДСК', 'PES'),
('ПЕВЕК', 'PWE'),
('ПОЛЯРНЫЙ', 'PYJ'),
('ПЯТИГОРСК', 'PTG'),
('РАДУЖНЫЙ', 'RAT'),
('РОСТОВ-НА-ДОНУ', 'ROV'),
('САЛЕХАРД', 'SLY'),
('САМАРА', 'KUF'),
('САРАНСК', 'SKX'),
('САРАТОВ', 'RTW'),
('СИМФЕРОПОЛЬ', 'SIP'),
('СЛЕПЦОВСКАЯ (ИНГУШЕТИЯ)', 'WZN'),
('СОЧИ / АДЛЕР', 'AER'),
('СОКОЛ', 'WZO'),
('САНКТ-ПЕТЕРБУРГ', 'LED'),
('СТАРЫЙ ОСКОЛ', 'WZP'),
('СТАВРОПОЛЬ', 'STW'),
('СТРЕЖЕВОЙ', 'SWT'),
('СУРГУТ', 'SGC'),
('СУЗДАЛЬ', 'SUZ'),
('СЫКТЫВКАР', 'SCW'),
('ТИКСИ', 'IKS'),
('ТОМСК', 'TOF'),
('ТВЕРЬ', 'TVE'),
('ТЮМЕНЬ', 'TJM'),
('УФА', 'UFA'),
('УХТА', 'UCT'),
('УЛАН-УДЭ', 'UUD'),
('УЛЬЯНОВСК', 'ULY'),
('УСИНСК', 'USK'),
('УСТЬ-ИЛЬИМСК', 'UIK'),
('ВЛАДИКАВКАЗ', 'OGZ'),
('ВЛАДИВОСТОК', 'VVO'),
('ВОЛГОДОНСК', 'VLK'),
('ВОЛГОГРАД', 'VOG'),
('ВОЛОГДА', 'VGD'),
('ВОРКУТА', 'VKT'),
('ВОРОНЕЖ', 'VOZ'),
('ЯКУТСК', 'YKS'),
('ЮЖНО-САХАЛИНСК', 'UUS');

ALTER TABLE cities
ADD COLUMN code VARCHAR(3);

UPDATE cities
SET code = 
    CASE 
        WHEN city = 'Нячанг' THEN 'CXR'
        WHEN city = 'Фантьет' THEN 'SGN'
        WHEN city = 'Сапа' THEN 'SAP'
        WHEN city = 'Дели' THEN 'DEL'
        WHEN city = 'Мумбаи' THEN 'BOM'
        WHEN city = 'Калькутта' THEN 'CCU'
        WHEN city = 'Джакарта' THEN 'CGK'
        WHEN city = 'Бали' THEN 'DPS'
        WHEN city = 'Джокьякарта' THEN 'JOG'
        WHEN city = 'Доха' THEN 'DOH'
        WHEN city = 'Духан' THEN 'DHN'
        WHEN city = 'Эр-Рувайс' THEN 'RUH'
        WHEN city = 'Дубай' THEN 'DXB'
        WHEN city = 'Абу-Даби' THEN 'AUH'
        WHEN city = 'Шарджа' THEN 'SHJ'
        WHEN city = 'Пекин' THEN 'PEK'
        WHEN city = 'Шанхай' THEN 'PVG'
        WHEN city = 'Гонконг' THEN 'HKG'
        WHEN city = 'Батуми' THEN 'BUS'
        WHEN city = 'Тбилиси' THEN 'TBS'
        WHEN city = 'Боржоми' THEN 'BDG'
        WHEN city = 'Улан-Батор' THEN 'ULN'
        WHEN city = 'Дархан' THEN 'ULZ'
        WHEN city = 'Мурэн' THEN 'MXV'
        WHEN city = 'Токио' THEN 'HND'
        WHEN city = 'Осака' THEN 'ITM'
        WHEN city = 'Киото' THEN 'KIX'
        WHEN city = 'Бангкок' THEN 'BKK'
        WHEN city = 'Паттайя' THEN 'UTP'
        WHEN city = 'Пхукет' THEN 'HKT'
        WHEN city = 'Осло' THEN 'OSL'
        WHEN city = 'Берген' THEN 'BGO'
        WHEN city = 'Тронхейм' THEN 'TRD'
        WHEN city = 'Копенгаген' THEN 'CPH'
        WHEN city = 'Орхус' THEN 'AAR'
        WHEN city = 'Оденсе' THEN 'ODE'
        WHEN city = 'Стокгольм' THEN 'ARN'
        WHEN city = 'Гётеборг' THEN 'GOT'
        WHEN city = 'Мальмё' THEN 'MMX'
        WHEN city = 'Цюрих' THEN 'ZRH'
        WHEN city = 'Женева' THEN 'GVA'
        WHEN city = 'Берн' THEN 'BRN'
        WHEN city = 'Хельсинки' THEN 'HEL'
        WHEN city = 'Эспоо' THEN 'HEL'
        WHEN city = 'Тампере' THEN 'TMP'
        WHEN city = 'Париж' THEN 'CDG'
        WHEN city = 'Марсель' THEN 'MRS'
        WHEN city = 'Лион' THEN 'LYS'
        WHEN city = 'Лондон' THEN 'LHR'
        WHEN city = 'Эдинбург' THEN 'EDI'
        WHEN city = 'Ливерпуль' THEN 'LPL'
        WHEN city = 'Мадрид' THEN 'MAD'
        WHEN city = 'Барселона' THEN 'BCN'
        WHEN city = 'Валенсия' THEN 'VLC'
        WHEN city = 'Рим' THEN 'FCO'
        WHEN city = 'Венеция' THEN 'VCE'
        WHEN city = 'Милан' THEN 'MXP'
        WHEN city = 'Салоники' THEN 'SKG'
        WHEN city = 'Афины' THEN 'ATH'
        WHEN city = 'Ираклион' THEN 'HER'
        WHEN city = 'Алжир' THEN 'ALG'
        WHEN city = 'Оран' THEN 'ORN'
        WHEN city = 'Аннаба' THEN 'AAE'
        WHEN city = 'Каир' THEN 'CAI'
        WHEN city = 'Александрия' THEN 'HBE'
        WHEN city = 'Шарм эль Шейх' THEN 'SSH'
        WHEN city = 'Найроби' THEN 'NBO'
        WHEN city = 'Момбаса' THEN 'MBA'
        WHEN city = 'Накуру' THEN 'NUU'
        WHEN city = 'Браззавиль' THEN 'BZV'
        WHEN city = 'Пуэнт-Нуар' THEN 'PNR'
        WHEN city = 'Бенгази' THEN 'BEN'
        WHEN city = 'Триполи' THEN 'TIP'
        WHEN city = 'Тархуна' THEN 'MJI'
        WHEN city = 'Йоханнесбург' THEN 'JNB'
        WHEN city = 'Соуэто' THEN 'SIS'
        WHEN city = 'Гебеха' THEN 'GHA'
        WHEN city = 'Виктория' THEN 'SEZ'
        WHEN city = 'Маэ' THEN 'MAU'
        WHEN city = 'Праслин' THEN 'PRI'
        WHEN city = 'Лагос' THEN 'LOS'
        WHEN city = 'Кано' THEN 'KAN'
        WHEN city = 'Абуджа' THEN 'ABV'
        WHEN city = 'Ксабланка' THEN 'CMN'
        WHEN city = 'Марракеш' THEN 'RAK'
        WHEN city = 'Фес' THEN 'FEZ'
        WHEN city = 'Хартум' THEN 'KRT'
        WHEN city = 'Омдурман' THEN 'KRT'
        WHEN city = 'Ньяла' THEN 'UYL'
        WHEN city = 'Лос-Анджелес' THEN 'LAX'
        WHEN city = 'Нью-Йорк' THEN 'JFK'
        WHEN city = 'Чикаго' THEN 'ORD'
        WHEN city = 'Хьюстон' THEN 'IAH'
        WHEN city = 'Торонто' THEN 'YYZ'
        WHEN city = 'Монреаль' THEN 'YUL'
        WHEN city = 'Оттава' THEN 'YOW'
        WHEN city = 'Пунта-Кана' THEN 'PUJ'
        WHEN city = 'Санто-Доминго' THEN 'SDQ'
        WHEN city = 'Ла-Романа' THEN 'LRM'
        WHEN city = 'Мехико' THEN 'MEX'
        WHEN city = 'Тихуана' THEN 'TIJ'
        WHEN city = 'Гвадалахара' THEN 'GDL'
        WHEN city = 'Гавана' THEN 'HAV'
        WHEN city = 'Сантьяго-де-Куба' THEN 'SCU'
        WHEN city = 'Санта-Клара' THEN 'SNU'
        WHEN city = 'Букараманга' THEN 'BGA'
        WHEN city = 'Богота' THEN 'BOG'
        WHEN city = 'Кали' THEN 'CLO'
        WHEN city = 'Буэнос-Айрес' THEN 'EZE'
        WHEN city = 'Кордова' THEN 'COR'
        WHEN city = 'Росарио' THEN 'ROS'
        WHEN city = 'Сан-Паулу' THEN 'GRU'
        WHEN city = 'Рио-де-Жанейро' THEN 'GIG'
        WHEN city = 'Бразилиа' THEN 'BSB'
        WHEN city = 'Сантьяго' THEN 'SCL'
        WHEN city = 'Пуэнте-Альто' THEN 'SCL'
        WHEN city = 'Антофагаста' THEN 'ANF'
        WHEN city = 'Лима' THEN 'LIM'
        WHEN city = 'Трухильо' THEN 'TRU'
        WHEN city = 'Арекипа' THEN 'AQP'
        WHEN city = 'Гамильтон' THEN 'HLZ'
        WHEN city = 'Тауранга' THEN 'TRG'
        WHEN city = 'Окленд' THEN 'AKL'
        WHEN city = 'Мельбурн' THEN 'MEL'
        WHEN city = 'Сидней' THEN 'SYD'
        WHEN city = 'Перт' THEN 'PER'
        WHEN city = 'Порт-Морсби' THEN 'POM'
        WHEN city = 'Вевак' THEN 'WWK'
        WHEN city = 'Лаэ' THEN 'LAE'
        ELSE NULL
    END;
'''
